
[{
    "Timestamp": "8/1/2025 8:26:27",
    "Judul Materi": "MATERI PRODUK KREATIF DAN KEWIRAUSAHAAN (PKDK)\nBAB HAK KEKAYAAN INTELEKTUAL (HAKI)",
    "Mata Pelajaran": "Produk Kreatif dan Kewirausahaan",
    "Rombongan Belajar": "XI",
    "Gambar untuk kebutuhan materi ": "",
    "Jurusan": "PPLG/Rekayasa Perangkat Lunak (RPL)",
    "Isi Materi": "A.\nMengenal KI dan HKI\nHKI adalah Hak Kekayaan Intelektual sedangkan KI merupakan singkatan dari kekayaan intelektual. KI diperoleh melalui hasil pemikiran berupa gagasan atau ide yang diwujudkan atau diekspresikan dalam bentuk penemuan.\n1.\nSejarah dan Pengertian HKI\nHak Kekayaan Intelektual atau Hak Milik Intelektual adalah padanan kata yang biasa digunakan  Intellectual Property  Rights (IPR) atau Geistiges Eigentum dalam bahasa Jerman. HKI terdiri dari 3 kata kunci yaitu, Hak, Kekayaan, dan Intelektual. Pengertian HKI menurut para ahli sebagai berikut:\na.\nMenurut David I. Bainbridge, HKI merupakan hak yang berasal dari hasil kegiatan kreatif suatu kemampuan daya pikir manusia yang diepresikan pada khalayak umum dalam berbagai bentuk yang memiliki manfaat serta berguna dalam menunjang kehidupan manusia dan memiliki nilai ekonomi.\nb.\nMenurut Lyle Glowka, HKI merupakan hukum privat yang memberikan penghargaan atas kontribusi manusia tidak berupa wujud yang akan digunakan untuk memproduksi suatu teknologi yang bersifat khusus.\nc.\nMenurut MC Keough dan Stewart, HKI adalah hak yang memberikan perlindungan hukum atas kreatif manusia yang memiliki manfaat ekonomi..\n2.\nPrinsip-Prinsip HKI \na.\nPrinsip Keadilan\nb.\nPrinsip Ekonomi\nc.\nPrinsip Sosial (Mengatur Kepentingan Manusia sebagai warga Negara).\nd.\nPrinsip Kebudayaan.\n3.\nKlasifikasi HKI \nBerdasarkan WPO, HKI dibagi menjadi dua bagian, yaitu:\na.\nHak Cipta (Copyright): \nHak eksklusif yang diberikan oleh negara bagi pencipta suatu karya\nb.\nHak Kekayaan Industri (Indrustial Property Rights):\nHak kekayaan industri adalah hak yang mengatur segala sesuatu penindustrian, terutama yang mengatur perlindungan hukum.\n4.\nDasar Hukum HKI\nHukum yang mengatur HKI bersifat tektorial, artinya pendaftaran ataupun penegakan HKI harus dilakukan secara terpisah di masing-masing yurisdiksi bersangkutan. Dasar hukum HKI:\na.\nPerjanjian Internasional\n•\nBerne Convention 1883 – Hak Cipta\n•\nParis Convention 1886 – Paten, Merek, Desain Industri\n•\nPerjanjian TRIPs (Agreement on Trade Related Aspects of Intellectual Property Rights) – WTO 1994.\n•\nKonvensi lainnya yang berkaitan dengan teknis, antara lain WCT ( WIPO Copyright Treaty), WPPT (Wipo Perfomances Phonograms Treaty), Madrid Protocol, dan PCT (Patent Cooperation Treaty).\nb.\nUndang – Undang Nasional\n•\nUU Nomor 6 Tahun 1982 tentang Hak Cipta (Lembaran Negara RI Tahun 1982 Nomor 15).\n•\nUU Nomor 7 Tahun 1994 tentang Ratifikasi Trade Related Aspects of Intellectual Property Rights (TRIPs).\n•\nUU Nomor 29 Tahun 2000 tentang Perlindungan Varietas Tanaman.\n•\nUU Nomor 30 Tahun 2000 tentang Rahasia Dagang.\n•\nUU Nomor 31 Tahun 2000 tentang Desain Industri.\n•\nUU Nomor 32 Tahun 2000 tentang Desain Tata. Letak Sirkuit Terpadu (DTLST).\n•\nUU Nomor 15 Tahun 2001 tentang Merek.\n•\nUU Nomor 28 Tahun 2014 tentang Hak Cipta.\n•\nUU Nomor 13 Tahun 2016 tentang Paten.\n5.\nPerlindungan Hukum HKI\nPerlindungan Hukum merupakan keadaan posisi dimana subjek hukum memperoleh kepastian hukum, memperoleh hak dan melaksanakan kewajiban berdasarkan hukum perundang-undangan yang berlaku, dan dapat dipaksakan pelaksaannya dengan suatu sanksi.\na.\nSistem Perlindungan Hukum:\nUnsur perlindungan hukum yaitu subjek perlindungan, objek hukum perlindungan, perbuatan hukum perlindungan, jangka waktu perlindungan, dan tindakan hukum perlindungan.\nb.\nUpaya Perlindungan\n•\nSistem Konstitutif\n•\nSistem Deklaratif \n•\nPerubahan Deklratif dari Sistem Deklaratif ke sistem Konstitutif.\n•\nPenemuan Masa Perlindungan \n•\nPenindakan dan Pemulihan.\n6.\nPendaftaran HKI\nPendaftaran HKI dilakukan atas permohonan yang diajukan oleh pemiliknya atau pemegang hak intelektual kuasanya. HKI Indonesia menganut dua sistem sebagai berikut:\na.\nSistem First To Life: \nPihak pertama yang mengajukan permohonan HKI atas suatu penemuan jika memenuhi syarat akan diberi perlindungan hukum guna memberi kepastian hukum dan biaya murah.\nb.\nSistem First To Invent: \nMemberikan hak pada penemu pertama dengan sekedar memberikan kepada pihak pertama yang  pertama mengajukan permohonan HKI untuk memberi perlindungan kepada mereka yang lemah ekonominya, yang tidak mampu mengajukan permohonan secara cepat.\n7.\nMengelola HKI\nDalam praktik perdagangan HKI ada yang dikenal dengan istilah waralaba dan lisensi yang harus dalam bentuk formal dan harus dicatat.\na.\nWaralaba:\nerupakan perikatan dimana salah satu pihak diberikan hak untuk memanfaatkan atau menggunakan HKI dan penemuan atau ciri khas usaha yang dimiliki pihak lain dengan suatu imbalan berdasarkan suatu persyaratan yang ditetapkannya dalam rangka penyediaan atau penjualan barang atau jasa.\nb.\nKontrak Lisensi:\nMerupakan pemberian hak untuk menikmati manfaat ekonomi dari suatu HKI yang diberikan oleh pemegang HKI kepada pihak kedua, melalui perjanjian dalam jangka waktu dan syarat yang diperjanjikan kepada penerima lisensi, dimana hak tidak beralih kepada penerima lisensi.\nB.\nJenis – Jenis Hak Kekayaan Intelektual\n\nKlasifikasi HKI dibagi menjadi 2 jenis, yaitu hak cipta dan hak kekayaan industri (industrial property rights). Hak kekayaan  industri dibnagi menjadi 6 jenis yaitu paten, desain industri, merk, perlindungan varuetas tanaman (PVT), desain tata letak dan sirkuit terpadu (DTLST) dan rahasia dagang. Jenis jenis hak tersebut memiliki ketentuan seperti penjelasan berbagai istilah dan sering digunakan, jangka waktu dan sanksi apabila melanggarnya.\n1.\nHak cipta (copyright)\nHak cipta merupakan hak khusus bagi pencipta untuk mengumumkan atau memperbanyak ciptaannya. Ciptaan yang dilindungi adalah bidang ilmu pengetahuan, sastra, dan seni. Berdasarkan undang undang hak cipta adalah hak eksklusif bagi pencipta yang timbul berdasarkan prinsip deklaratif setelah suatu ciptaan diwujudkan dalam bentuk nyata tanpa mengurangi pembatasan sesuai ketentuan. Berdasarkan undang-undang no 28 tahun 2014 tentang hak cipta, pencipta adalah seorang atau beberapa orang yang sendiri sendiri atau bersama-sama menghasilkan suatu ciptaan yang bersifat khas dan pribadi (pasal 1 ayat 2). Hak cipta terdiri atas hak moral dan hak ekonomi (pasal 4). Hak moral adalah hak melekat secara pribadi pada diri pencipta (pasal 5 ayat 1). Sedangkan, hak ekonomi adalah hak eksklusif pencipta atau pemegang hak cipta untuk mendapatkan manfaat ekonomi atas ciptaan (pasal 8). Beralihnya hak cipta dapat disebabkan karena pewarisan, hibah, wakaf, wasiat, perjanjian tertulis, atau sebab sebab lain yang dibenarkan sesuai dengan ketentuan peraturan perundang-undangan (pasal 16).\nPerlindungan suatu ciptaan timbul secara otomatis sejak ciptaan itu diwujudkan dalam bentuk nyata. Berdasarkan pasal 40 berbagai ciptaan yang dilindungi antara lain:\na.\nBuku, Pamflet, Perwajahan karya tulis yang diterbitkan, dan semua karya tulis\nb.\nCeramah, Kuliah, pidato, dan sejenisnya\nc.\nAlat praga yang dibuat untuk pendidikan atau pengetahuan\nd.\nLagu atau musik dengan tanpa teks\ne.\nDrama, drama musikal, tari, koreografi, pewayangan dan pantomim\nf.\nKarya seni rupa seperti lukisan, gambar, ukiran dan sejenisnya\ng.\nKarya seni terapan, karya arsitektur, peta, karya seni batik, dan sejenisnya\nh.\nTerjemahan, tafsiran, saduran, bunga rampai, dan sejenisnya\ni.\nTerjemahan, adaptasi, aransemen dan modifikasi ekspresi budaya tradisional\nj.\nKompilasi ciptaan atau data baik dalam format yang dapat dibaca maupun media lainnya\nk.\nKomplikasi budaya ekspresi budaya tradisional\nl.\nPermainan vidio\nm.\nProgram kompoter\nBerdasarkan pasal 41, hasil karya yang tidak dapat dilindungi hak ciptanya sebagai berikut.\na.\nHasil karya yang belum dikujudkan dalam bentuk nyata\nb.\nSetiap ide, prosedur, sistem, metode, konsep, prinsip, temuan, atau data walaupun telah diungkapkan, dinyatakan, digambarkan, dijelaskan, atau digabungkan dalam sebuah ciptaan\nc.\nAlat, benda, atau produk yang diciptakan hanya untuk menyelesaikan masalah teknis atau yang bentuknya hanya ditujukkan untuk kebutuhan fungsional\nPihak-pihak yang dianggap pencipta atau pemegang hak cipta terhadap suatu ciptaan.\na.\nOrang  yang namanya terdaftar dalam Daftar Umum Ciptaan pada Direktorat Jenderal\nb.\nOrang yang namanaya disebut dalam ciptaan atau diumumkan sebagai pencipta pada suatu ciptaan\nc.\nOrang yangh berceramah, pada ceramah yang tidak menggunakan bahan tertulis dan tidak ada pemberitahuan siapa penciptanya\n2.\nHak Kekayaan Industri\nHak kekayaan indutstri merupakan hak yanh mengatur segala sesuatu milik perindustrian, terutama yang mengatur perlindungan hukum. Hak kekayaan industri meliputi hak sebagai berikut.\nA.\nHak paten\nBerdasarkan Undang-Undang Nomor 13 Thaun 2016, paten adalah hak eksklusif uang diberikan oleh negara kepada inventor atas hasil invevensinya di bidang teknologi, untuk jangka waktu tertentu melaksanakan sendiri invensi tersebut atau memberikan persetujuan kepada pihak lain untuk melaksakannnya (pasal 1 ayat 1). Paten terdiri atas 2 jenis, yaitu.\n1)\nPaten\nPaten diberikan untuk invensi baru, mengandung langkah invensif, dan dapat diterapkan dalam industri\n2)\nPaten Sederhana\nPaten sederhana diberikan untuk invensi baru, pengembangan dari produk atau proses yang telah ada, dan dapat diterapkan dalam industri.\nInvensi yang tidak dapat diberikan paten sebagai berikut.\n1)\nProses atau produk yang pengumuman, penggunaan, atau pelaksanaannya bertentangan dengan peraturan perundang-undangan, agama, ketertiban umum, atau kesusilaan.\n2)\nMetode pemeriksaan, perawatan, pengobatan, dan/atau pembedahan yang diterapkan kepada manusia dan/atau hewan\n3)\nTeori dan metode di bidang ilmu pengetahuan dan matematika\n4)\nMakhluk hidup kecuali jasad renik\n5)\nProses biolohis yang esensial untuk memproduksi tanaman atau hewan, kecuali proses nonbiologis atau proses mikrobiologis\nB.\nHak Merek\nBerdasarkan UU No.15 Tahun 2001 tentang Merek, merek adalah suatu tanda yang berupa gambar, nama, kata, huruf-hurur, angka-angka, susunan warna atau kombinasi dari unsur-unsur tersebut yang memiliki daya pembeda dan digunakan dalam kegiatan perdagangan barang dan jasa. Dalam merek, terdapat beberapa istilah sebagai berikut.\n1)\nMerek Dagang\n2)\nMerek Jasa\n3)\nMerek Kolektif\nC.\nDesain industri\nBerdasarkan Undang-Undang Nomor 31 Tahun 2000 tentang Desain Industri, desain industri adalah suatu kriasi tentang bentuk. Konfigurasi, atau komposisi garis atau warna, atau garis dan warna, atau gabungan daripadanya yang berbentuk tiga dimensi atau dua dimensi yang memberikan kesan estetis dan dapat diwujudkan dalam pola tiga dimensi atau dua dimensi serta dapat dipakai untuk menghasilkan suatu produk, barang, komoditas industri, atau kerajinan tangan (pasal 1 ayat 1).\nSyarat yang harus dimiliki desain industri sebagai berikut.\n1.\nMemiliki unsur kebaruan\n2.\nMemiliki nilai estetika\n3.\nKreasi suatu desain dapat dilihat, baik dengan kasatmata maupun menggunakan alat bantu\n4.\nDapat diproduksi secara massal\nD.\nRahasia dagang (trade secret)\n\nMenurut Undang-Undang Nomor 30 Tahun 2000 tentang Rahasia Dagang, rahasia dagang adalah informasi yang tidak diketahui oleh umum di bidang teknologi dan/atau bisnis, mempunyai nilai ekonomi karena berguna dalam kegiatan usaha, dan dijaga kerahasiaannyaoelh pemilik rahasia dagang.\n\nLisensi merupakan izin yang diberikan oleh pemilik rahasia dagang kepada pihak lain melalui suatu perjanjian berdasarkan pada pemberian hak (bukan pengalihan hak) untuk menikmati manfaat ekonomi dari suatu rahasia dagang yang diberi perlindungan dalam jangka waktu tertentu dan syarat tertentu.\nE.\nHak Varietas tanaman\nPerlindungan Varietas Tanaman (PVT) atau hak pemulia tanaman adalah hak kekayaan intelektual yang diberikan kepada pihak pemulia tanaman atau pemegang PVT untuk memegang kendali secara eksklusif terhadap bahan perbanyakan (mencakup benih, stek, anakan, atau jaringan biakan) dan material yang dipanen (bunga potong, buah, potongan daun) dari suatu varietas tanaman baru untuk digunakan dalam jangka waktu yang telah ditentukan. Hak PVT dapat beralih atau dialihkan karena : \n1.\nPewarisan;\n2.\nHibah\n3.\nWasiat;\n4.\nPerjanjian dalam bentuk akta notaris; atau\n5.\nSebab lain yang dibenarkan oleh undang-undang",
    "Tujuan Pembelajaran": "Setelah mempelajari materi ini, peserta didik diharapkan dapat:\n-\nMemahami dan mejelaskan hak kekayaan intelektual\n-\nMemahami dan mempresentasikan hak kekayaan intelektual",
    "THUMBNAIL\nYANG TIDAK MENGISI MALAMNYA DIPARANI ANOMALI SEBAGAI BERIKUT": ""
  },
  {
    "Timestamp": "8/1/2025 8:34:10",
    "Judul Materi": "Dasar-Dasar Pembuatan Gim dengan HTML Canvas dan JavaScript",
    "Mata Pelajaran": "Mata Pelajaran Pilihan - Game",
    "Rombongan Belajar": "XI",
    "Gambar untuk kebutuhan materi ": "",
    "Jurusan": "PPLG/Rekayasa Perangkat Lunak (RPL)",
    "Isi Materi": "1.        Pengertian JavaScript\nJavaScript adalah Bahasa pemrograman skrip yang dimasukkan dalam kode HTML dan dijalankan di sisi client, sehingga memperluas kemampuan dokumen HTML. JavaScript tidak memerlukan kompilator atau penerjemah khusus untuk menjalankannya.\n2.        Kelebihan JavaScript\n•        Bahasa pemrograman yang mudah di pelajari.\n•        Fleksibel atau dapat digunakan untuk berbagai jenis aplikasi.\n•        Halaman web yang interaktif dan responsif.\n•        Multiplatform dan Cross-browser atau dapat di implementasikan di berbagai sistem operasi dan hampir semua browser mendukung JavaScript.\n3.        Kekurangan JavaScript\n•        Masalah Keamanan. Dikarenakan kode JavaScript dapat dilihat oleh siapa pun yang mengunjungi halaman web.\n•        Keterbatasan Objek yang dapat digunakan yang mempengaruhi fitur-fitur yang tersedia dalam bahasa pemrograman.\n•        Tidak Cocok untuk Pengembangan StandAlone  App yang berdiri sendiri.\n4.        Fungsi dan Cara Kerja JavaScript\nJavaScript memiliki berbagai fungsi dalam pengembangan web, di antaranya\n•        Membuat Webstie Interaktif..\n•        Memanipulasi elemen HTML (DOM) secara dinamis.\n•        Mengelola data dari sisi klien.\n•        Komunikasi dengan server (AJAX).\n•        Mendukung pengembangan full-stack.\nJavaScript memiliki cara kerja yang terdiri dari dua sisi yaitu, penggunaan dari sisi client (mengubah tampilan halaman website) dan dari sisi server (pengelolaan database). Berikut penjelasannya.\na.        Cara Kerja JavaScript di sisi client (klien)\nJavaScript dapat dituliskan langsung di dalam halaman HTML menggunakan tag <script> atau disimpan terpisah dalam file berekstensi .js yang kemudian dihubungkan ke halaman HTML. Ketika pengguna membuka sebuah halaman web, browser akan mengunduh dan mengeksekusi kode JavaScript tersebut secara langsung di perangkat pengguna tanpa harus memprosesnya di server.\nKode JavaScript yang berjalan di sisi klien umumnya digunakan untuk memanipulasi tampilan (DOM), menanggapi interaksi pengguna, serta menambahkan efek dinamis pada halaman web. Namun, jika browser yang digunakan tidak mendukung JavaScript atau pengguna menonaktifkannya, sebagian fungsi pada halaman web tidak dapat berjalan dengan baik.\nb.        Cara Kerja JavaScript di sisi server\nJavaScript di sisi server umumnya dijalankan melalui lingkungan runtime seperti Node.js. Berbeda dengan pemrosesan di sisi klien, JavaScript server-side memiliki akses penuh ke sistem server seperti database, file system, dan jaringan.\nSalah satu ciri khas JavaScript di sisi server adalah sifatnya yang non-blocking. Artinya, saat suatu proses sedang berjalan (misalnya pengambilan data dari database), server tidak perlu menunggu proses tersebut selesai untuk menjalankan perintah berikutnya. Pendekatan asynchronous ini membuat pemrosesan data menjadi lebih cepat dan efisien, terutama pada aplikasi yang menangani banyak permintaan sekaligus, seperti API backend, layanan chat real-time, atau aplikasi streaming.\n \n5.        Penggunaan Umum JavaScript\n1.        Interaktivitas pada Website\nJavaScript digunakan untuk membuat elemen website menjadi dinamis dan interaktif, seperti:\n•        Dropdown menu\n•        Slide gambar (carousel)\n•        Form validation (validasi form sebelum dikirim ke server)\n•        Scroll animasi\n•        Popup/modal.\n2.        Manipulasi DOM (Document Object Model)\nJavaScript memungkinkan kamu untuk Menambah, menghapus, atau mengubah elemen HTML/CSS secara real-time.\n3.        AJAX dan Fetch API (Asynchronous Communication)\nUntuk mengambil data dari server tanpa me-reload halaman, biasanya digunakan untuk:\n•        Menampilkan data dari database (tanpa reload)\n•        Live search (pencarian langsung)\n•        Infinite scroll.\n4.        Pengolahan Data di Client-side\nJavaScript bisa digunakan untuk menghitung, memformat, dan memproses data langsung di sisi klien sebelum dikirim ke server.\n5.        Pembuatan Aplikasi Web dan Mobile\nDengan framework modern seperti:\n•        React.js, Vue.js, Angular → untuk web frontend\n•        Node.js → untuk backend server\n•        React Native, Ionic → untuk aplikasi mobile.\n6.        Pembuatan Game Sederhana\nDengan Canvas API atau framework seperti Phaser, JavaScript bisa digunakan untuk membuat game berbasis web 2D.\n7.        Validasi Form\nSalah satu penggunaan tertua dan paling umum Memastikan input pengguna benar (email, password, dll) sebelum dikirim.\n8.        Menangani Waktu dan Event\nJavaScript dapat digunakan untuk:\n•        Menampilkan jam real-time\n•        Menjadwalkan aksi dengan setTimeout() atau setInterval()\n•        Menanggapi event seperti klik, hover, scroll.\n6. Menuliskan Syntax JavaScript dalam HTML\nAda 3 cara penulisan syntax JavaScript, di antara lain:\n1. Menulis JavaScript pada Tag <script>\n2. Menulis JavaScript pada File Eksternal\n3. Menulis JavaScript pada Atribut\n7.        Statement Javascript\nStatement/Pernyataan adalah intruksi atau alur kerja sebuah program. Pada JavaScript, ada dua aturan salam penulisan statement. di antaranya, Simple Statement yang diakhiri dengan titik koma/semicolon (;) dan Complex Statement yang dapat diakhir tanpa titik koma/semicolon.\n8.        Variabel JavaScript\nVariabel adalah wadah untuk menyimpan data di dalam program. Dengan variabel, kita bisa menyimpan nilai lalu menggunakannya kembali. Aturan pemberian nama variabel sebagai berikut.\na.        Nama variabel diawali dengan huruf.\nb.        Nama variabel bisa mempergunakan huruf, angka, karakter ‘&’ atau ‘_’.\nc.        Tidak boleh mempergunakan karakter @, -, atau spasi.\nd.        Nama variabel tidak boleh menggunakan bahasa\npemrograman, contoh: if, boolean, break, dsb.\nCara mendeklarasikan variabel pada JavaScript ada 3 yaitu sebagai berikut:\na)        var = bersifat global/function scope, bisa diubah dan dideklarasikan ulang.\nb)        let = bersifat block scope, bisa diubah tetapi tidak bisa dideklarasikan ulang dalam scope yang sama.\nc)        const = bersifat block scope dan nilainya tidak bisa diubah setelah diinisialisasi.\n9.        Comment JavaScript\nComment adalah teks atau catatan dalam kode yang tidak akan dijalankan oleh JavaScript. Comment digunakan untuk memberikan keterangan atau mematikan sementara baris kode. Jenis comment dibagi menjadi 2 yaitu Single Line Comment menggunakan “// comment satu baris” dan Multi Line Comment menggunakan “/* komen multi baris */”. \n10.        Tipe Data JavaScript\nJavaScript memiliki 2 kategori tipe data utama:\na.        Tipe Data Primitif\n•        Number (Tipe data angka).\n•        String (Tipe data character).\n•        Boolean (Tipe data logika. True & False). \n•        Null (Tipe data deklarasi variabel tidak memiliki nilai).\n•        Undefined (Tipe data yang belum diberi nilai).\n•        Symbol (Tipe data untuk membuat nilai unik).\n•        BigInt (Tipe data angka yang sangat besar).\nb.        Tipe Data Non-Primitif (Object)\n•        Object (Tipe data menyimpan data dalam bentuk pasangan key & value).\n•        Array (Tipe data kumpulan data yang diindeks).\n11.        String\nString adalah tipe data di JavaScript yang digunakan untuk menyimpan teks atau rangkaian karakter (huruf, angka, simbol). String ditulis di antara tanda kutip: tunggal ('') atau ganda (\"\"\"\").\n12.        Assignment Operator pada JavaScript\nAssignment Operator digunakan untuk memberikan nilai ke variabel. Operator dasar adalah =. Ada juga operator gabungan yang mempermudah perhitungan.\n13.        Operator Perbandingan pada JavaScript\nOperator Perbandingan digunakan untuk membandingkan dua nilai dan menghasilkan true atau false.\n14.        Operator Logika pada JavaScript\nOperator Logika digunakan untuk menggabungkan beberapa kondisi dan menghasilkan true atau false.\n15.        Looping JavaScript\nLooping (perulangan) adalah proses menjalankan blok kode berulang kali selama kondisi tertentu terpenuhi. Digunakan untuk mengurangi penulisan kode yang sama secara berulang.\n16.        Function JavaScript\nFunction (fungsi) adalah blok kode yang dirancang untuk melakukan tugas tertentu dan bisa dipanggil berulang kali. Fungsi dapat menerima input (parameter) dan mengembalikan nilai.\n17.        Variabel Scope pada JavaScript\nScope dalam Javascript adalah konteks atau ruang lingkup di mana variabel, fungsi, dan objek tersedia dalam kode anda. Scope membatasi akses ke variabel dan membantu menghindari pertentangan nama variabel dalam sebuah kode. Ada tiga jenis scope dalam Javascript: Global, Lokal, dan Block Scope.\na.        Global Scope\nVariabel yang didefinisikan di luar blok kode atau fungsi manapun dalam suatu file Javascript memiliki cakupan global. Artinya, variabel tersebut bisa diakses dari mana saja dalam file tersebut, baik di dalam fungsi, blok kode ataupun di luar.\nb.        Lokal Scope atau Function Scope\nVariabel yang dibuat dalam sebuah fungsi memiliki scope lokal atau function scope. Mereka hanya bisa diakses dari dalam fungsi itu sendiri.\nc.        Block Scope\nES6 menambahkan let dan const sebagai cara baru untuk mendeklarasikan variabel. Berbeda dengan var yang memiliki function scope, variabel yang dideklarasikan dengan let atau const akan memiliki block scope. Artinya, variabel tersebut hanya bisa diakses dalam block yang sama, baik itu berupa fungsi, kondisi if atau for loop.\n18.        Mode Strict JavaScript\nStrict mode adalah mode eksekusi yang memperketat aturan JavaScript: kesalahan yang sebelumnya “diam‑diam” dibiarkan menjadi error, beberapa fitur berbahaya/ambigu dilarang, dan perilaku tertentu dibuat lebih konsisten agar kode lebih mudah dioptimalkan dan aman. Tujuannya: menemukan bug lebih cepat, mengurangi ambiguitas, dan meningkatkan keamanan. Cara mengaktifkan mode ini yaitu dengan cara sebagai berikut:\na.        Seluruh file/script: tulis “use strict”; di paling atas.\nb.        Function only: tulis “use strict”; sebagai statement pertama di badan fungsi.\nc.        Modul & Class: tidak perlu “use strict”; secara sudah bawaan sistem. Strict tidak bisa di terapkan di setiap blok.\n \n19.        Objek pada Browser/Browser Object Model (BOM) \nBrowser Object Model atau yang biasa dikenal dengan BOM adalah sebuah API yang memungkinkan kamu untuk berinteraksi dengan browser. Ini merupakan bagian dari JavaScript yang memberikan akses ke objek-objek di tingkat browser. Berikut beberapa objek penting yang ada dalam BOM:\n•        window: Ini adalah objek global, dan semua yang lain (termasuk dokumen itu sendiri dengan DOM) berada di dalamnya.\n•        navigator: Object ini mewakili browser itu sendiri dan memungkinkan kamu mendapatkan informasi tentangnya.\n•        screen: Representasi dari layar pengguna, memungkinkan kamu mendapatkan informasi seperti resolusi.\n•        location: Objek ini memberikan informasi tentang halaman yang sedang dimuat saat ini dan memungkinkan kamu untuk mengubahnya.\n•        history: Memberikan akses ke riwayat browser.\n20.        Document Object Model (DOM)\nDocument Object Model (DOM) adalah representasi terstruktur dari dokumen HTML atau XML dalam bentuk pohon (tree structure). DOM memungkinkan bahasa pemrograman seperti JavaScript untuk mengakses, memanipulasi, dan memodifikasi elemen pada halaman web.\nFungsi DOM antara lain:\na.        Memungkinkan kita membaca dan mengubah elemen HTML (tulisan, atribut, style, dll).\nb.        Menambahkan atau menghapus elemen pada halaman secara dinamis.\nc.        Memfasilitasi interaksi pengguna dengan halaman web melalui event (klik, input, dsb).\nCara kerja DOM:\n•        Saat browser memuat halaman web, HTML akan diproses dan diubah menjadi DOM Tree.\n•        Setiap tag HTML menjadi sebuah node atau object dalam DOM.\n•        JavaScript dapat menggunakan API DOM untuk mengakses node-node tersebut dan melakukan manipulasi.\n21.        Document Object Model (DOM) Selector\nDOM Selector adalah metode atau fungsi yang digunakan untuk memilih/mengambil elemen dari halaman web melalui DOM. Dengan selector, kita dapat memanipulasi elemen tertentu sesuai kebutuhan.\nFungsi Selector:\na.        Memilih elemen berdasarkan id, class, tag name, atau query selector.\nb.        Memudahkan pengembang untuk mengakses elemen yang ingin dimodifikasi.\nJenis DOM Selector & Cara Kerja\na)        getElementById() = memilih elemen berdasarkan id\nconst judul = document.getElementById(\"\"judul\"\");\nb)        getElementByClassName() = memilih semua elemen dengan class tertentu\nconst paragraf = document.getElementsByClassName(\"\"teks\"\");\nc)        getElementByTagName() = memilih semua elemen berdasarkan nama tag\nconst list = document.getElementsByTagName(\"\"li\"\");\nd)        querySelector() = memilih elemen pertama yang cocok dengan selector CSS\nconst item = document.querySelector(\"\".menu li\"\");\ne)        querySelectorAll() = memilih semua elemen yang cocok dengan selector CSS\nconst items = document.querySelectorAll(\"\".menu li\"\");\n22.        Document Object Model (DOM) Event\nDOM Event adalah mekanisme untuk menangani interaksi pengguna atau perubahan di halaman web, seperti klik tombol, memasukkan teks, scroll, atau ketika halaman selesai dimuat.\nFungsi DOM Event:\na.        Menangkap aksi pengguna untuk memicu fungsi tertentu\nb.        Membuat halaman lebih interaktif dan responsif.\nc.        Memungkinkan pengembang mengontrol perilaku halaman berdasarkan kejadian tertentu.\nCara Kerja DOM Event:\na.        Ketika pengguna berinteraksi dengan halaman (misalnya klik tombol), event akan dipicu.\nb.        JavaScript dapat menangkap event tersebut menggunakan event listener.\nc.        Fungsi callback yang ditentukan akan dijalankan sebagai respon dari event.\nContoh Event Umum:\n•        Click = ketika elemen diklik\n•        Mouseover = ketika kursor diarahkan ke elemen\n•        Keydown / keyup = ketika tombol keyboard ditekan/dilepas\n•        Submit = ketika form dikirim",
    "Tujuan Pembelajaran": "Setelah mengikuti pembelajaran ini, peserta didik diharapkan mampu:\n1.\nMemahami dasar-dasar HTML dan JavaScript dalam konteks pembuatan game.\n2.\nMenguasai pembuatan dan pengelolaan elemen <canvas> dalam HTML.\n3.\nMengembangkan objek-objek visual interaktif dalam canvas menggunakan JavaScript.\n4.\nMengintegrasikan prinsip Pemrograman Berbasis Teks dan Grafis dalam pembuatan game sederhana.\n5.\nMenerapkan prinsip UI/UX dalam tampilan dan alur permainan.\n6.\nMemahami struktur data, state dinamis dan fungsionalitas dalam game engine berbasis JavaScript.\n7.\nMenerapkan debugging, pengujian performa, dan pembaruan dalam pengembangan game.",
    "THUMBNAIL\nYANG TIDAK MENGISI MALAMNYA DIPARANI ANOMALI SEBAGAI BERIKUT": ""
  },
  {
    "Timestamp": "8/1/2025 8:48:19",
    "Judul Materi": "Application Programming Interface (API)",
    "Mata Pelajaran": "Pemrograman Perangkat Bergerak",
    "Rombongan Belajar": "XI",
    "Gambar untuk kebutuhan materi ": "https://drive.google.com/open?id=1DPUF7o1yUuBsE-C38iv3FiLlhTNOyLrY",
    "Jurusan": "PPLG/Rekayasa Perangkat Lunak (RPL)",
    "Isi Materi": "1.\nDefinisi Dan Konsep API\n \nGambar 1.  1 Skema Konektivitas API Antar Software\nAPI (Application Programming Interface) adalah antarmuka yang menghubungkan satu aplikasi dengan aplikasi lainnya. API berfungsi sebagai perantara agar dua sistem atau aplikasi yang berbeda bisa saling berkomunikasi dan bertukar data, baik dalam satu platform maupun lintas platform.\n2.\nJenis-jenis API\n    a.\nPublic API\nAPI yang terbuka untuk umum dan dapat digunakan oleh siapa saja. Umumnya digunakan dalam pengembangan aplikasi lintas platform.\nb.\nPrivate API\nPrivate API adalah jenis API yang tidak terbuka untuk penggunaan umum. API jenis ini dibuat untuk keperluan internal dalam pengembangan aplikasi tertentu, seperti API dari back end yang digunakan untuk mengakses front end dari sebuah website, atau aplikasi untuk pengembangan aplikası mobile\nc.\nComposite API\nAPI yang menggabungkan beberapa permintaan ke berbagai server atau layanan menjadi satu respons.\n3.\nManfaat API\na.\nMemudahkan membangun aplikasi yang fungsional.\nb.\nPengembangan aplikasi menjadi lebih efisien dan hemat waktu\nc.\nMengurangi beban server\n4.\nArsitektur API\na.\nRPC (Remote Procedure Call)\nRPC merupankan teknologi untuk membuat komunikasi antara client side dan server side dilakuakan dengan konsep sederhana. RPC memiliki dua jenis, yaitu XML-RPC menggunakan format XML untuk perpindahan data dan JSON-RPC menggunakan JSON untuk perpindahan data.\nb.\nSOAP (Simple Object Access Protocol)\nMenggunakan XML(Extensible Markup Language) untuk menyimpan data dalam dokumen.\nc.\nREST (Representational State Transfer)\nREST menggunakan JSON untuk bentuk datanya sehingga lebih ringan. Performa aplikasi menjadi lebih baik.\n5.\nCara Kerja API\na.\nAplikasi mengakses API\nb.\nAPI melakukan request ke server\nc.\nServer memberi respon ke API\nd.\nAPI menyampaikan respons ke aplikasi\nB.\nAutentikasi\n1.\nDefinisi autentikasi\nAutentikasi adalah proses validasi atau pembuktian terhadap identitas atau kredensial hendak memasuki sebuah sistem atau layanan yang penting. Autentikasi ini dilakukan membuktikan bahwa pengguna yang hendak login benar-benar pemilik akun yang sah.\n2.\nJenis-jenis autentikasi\na.\n2FA (Two Factor Autentication)\n2FA merupakan autentikasi dengan menggunakan password.\nb.\n3FA (Three Factor Autentication)\n3FA merupakan autentikasi dengan menggunakan kata sandi, token, biometrik.\nc.\nMFA\nMFA merupakan autentikasi yang memerlukanlebih dari dua idependen untuk mengidentifikasi pengguna.\nd.\nOTP\nOTP merupakan kode atau karakter khusus yang akan dihasilkan secara otomatis untuk pengguna yang ingin login.\ne.\nBiometrik\nBiometrik merupakan proses autentikasi yang menggunakan karakteristik biologis, seperti sidik jari, wajah atau retina, dan pengenalan suara.\n3.\nFungsi autentikasi\na.\nMemastikan permintaanakses valid\nb.\nMelakukan konfirmasi ganda\nc.\nMelakukan pemblokiran akun pada aktivitas mencurigakan\nd.\nMenjaga keamanan data pada akun.\n \n4.\nCara Kerja autentikasi\na.\nUser akan terhubung ke jaringan\nb.\nSetelah itu server akan meminta identitas akun seperti username dan password.\nc.\nKemudian server akan mencocokkan data yang dikirim dengan database pengguna milik mereka.\nd.\nApabila data yang dimasukkan cocok, maka akses login akan langsung diberikan dan sistem akan mencatat aktivitas login pengguna\ne.\nApabilang kali blakecocokan data, maka permintaan akses ditolak. Kemudian jika ingin mencoba mencurigakan, seperti pembobolan akun. berulang kali biasanya akan terjadi blokir sementara karena dianggap sebagai aktivitas yang mencurigakan, seperti pembobolan akun\n5.\nFirebase\nFirebase authentication adalah salah satu layanan back end, fitur Android dan iOS, SDK yang mudah digunakan, serta tampilan interface siap pakai untuk melakukan autentikasi pengguna ke aplikasi yang telah dibuat. Firebase authentication mendukung autentikasi menggunakan nomor telepon, sandi, dan penyedia identitas gabungan populer seperti Google dan Facebook.\n",
    "Tujuan Pembelajaran": "",
    "THUMBNAIL\nYANG TIDAK MENGISI MALAMNYA DIPARANI ANOMALI SEBAGAI BERIKUT": "Option 1"
  },
  {
    "Timestamp": "8/1/2025 8:48:49",
    "Judul Materi": "Jenis - Jenis Usaha",
    "Mata Pelajaran": "Produk Kreatif dan Kewirausahaan",
    "Rombongan Belajar": "XI",
    "Gambar untuk kebutuhan materi ": "",
    "Jurusan": "PPLG/Rekayasa Perangkat Lunak (RPL)",
    "Isi Materi": "- Berdasarkan bidang usaha  di Indonesia :\n1.\nUsaha Perdagangan\nUsaha yang bergerak dalam jual beli barang atau jasa. Contohnya termasuk toko kelontong, supermarket, agen penjualan, dan pedagang grosir atau eceran. Peran utamanya adalah mendistribusikan barang dari produsen ke konsumen. (liputan6.com)\n2.\nUsaha Jasa\nUsaha yang menawarkan layanan atau keahlian tertentu tanpa menghasilkan barang fisik. Contohnya meliputi jasa konsultan, pendidikan, kesehatan, transportasi, dan pariwisata. Keunggulannya adalah biaya operasional yang relatif lebih rendah dibandingkan usaha yang memproduksi barang fisik. Namun, tantangannya adalah membangun kepercayaan konsumen dan menjaga kualitas layanan secara konsisten. (liputan6.com)\n3.\nUsaha Produksi (Manufaktur)\nUsaha yang mengolah bahan baku menjadi barang jadi atau setengah jadi. Contohnya termasuk industri tekstil, makanan dan minuman, otomotif, elektronik, dan farmasi. Usaha ini memiliki potensi keuntungan yang besar, namun juga membutuhkan modal yang besar untuk pengadaan mesin dan peralatan produksi. Tantangannya antara lain efisiensi proses produksi, pengendalian kualitas, dan pengelolaan rantai pasokan. (InCorp Indonesia, liputan6.com)\n4.\nUsaha Pertanian\nUsaha yang memanfaatkan lahan untuk bercocok tanam, baik untuk kebutuhan rumah tangga maupun industri. Contoh jenis usaha di bidang pertanian antara lain:\n•\nPerkebunan jeruk, kopi, dan kelapa sawit\n•\nBudidaya tanaman hias dan sayuran hidroponik\n•\nPertanian organik\n•\nPadi, jagung\nSumber : https://www.cimbniaga.co.id/id/inspirasi/bisnis/peluang-usaha-pertanian-menjanjikan-dan-cara-memulainya \n5.\nUsaha Pertambangan\nUsaha yang bergerak dalam bidang penambangan mineral, seperti emas, batu bara, dan lain-lain. Usaha ini memerlukan perhatian khusus terhadap faktor-faktor seperti perizinan, keselamatan kerja, dan perlindungan lingkungan untuk memastikan bisnis pertambangan berjalan dengan aman dan sesuai peraturan. (Edufund, Legalist Indonesia)\n6.\nUsaha Pariwisata\nUsaha yang memanfaatkan alam, budaya, dan kreativitas untuk menarik wisatawan. Contohnya termasuk tempat rekreasi, hotel, restoran, penyewaan transportasi, dan suvenir. Sektor ini merupakan bidang jasa, karena produknya tidak berwujud dan berfokus pada pengalaman konsumen. (Legalist Indonesia, HaloEdukasi.com)\n7.\nUsaha Teknologi\nUsaha yang bergerak dalam bidang pengembangan dan penerapan teknologi informasi dan komunikasi. Contohnya termasuk pengembangan perangkat lunak, aplikasi mobile, layanan cloud computing, dan e-commerce. Bidang ini berkembang pesat seiring dengan kemajuan teknologi dan digitalisasi. (https://www.telkomsel.com/about-us/blogs/strategi-telkomsel-mendorong-adopsi-cloud-untuk-mendukung-pengembangan-bisnis#:~:text=Ya%2C%20cloud%20computing%20atau%20komputasi%20awan%20tanpa,transformasi%20digital%20yang%20tengah%20berlangsung%20di%20Telkomsel)\n8.\nUsaha Keuangan\nUsaha yang menyediakan layanan terkait pengelolaan keuangan, seperti perbankan, asuransi, investasi, dan manajemen aset. Contohnya termasuk bank, perusahaan asuransi, perusahaan sekuritas, dan lembaga keuangan non-bank lainnya. Usaha ini memainkan peran penting dalam mendukung perekonomian dengan menyediakan akses keuangan bagi individu dan perusahaan. (Accurate, InCorp Indonesia)\n9.\nUsaha Retail\nUsaha ritel adalah bisnis yang menjual barang atau jasa langsung kepada konsumen akhir. Bisa dilakukan secara fisik (toko, minimarket) maupun online. Umumnya minim risiko karena persaingan terbatas di antara pengecer. Contohnya termasuk Indomaret, Alfamart, serta toko online seperti Shopee dan Lazada. (https://www.youtap.id/en/blog/bisnis-retail#:~:text=%E2%80%8D-,Apa%20Itu%20Bisnis%20Retail?,margin%20keuntungan%20peritel%2C%20dan%20pajak)\n10.\nPerusahaan Start Up\nStartup adalah bisnis baru dengan ide inovatif yang biasanya mengandalkan teknologi digital untuk pertumbuhan cepat. Modal awalnya biasanya rendah, tapi potensi skalanya tinggi. Di Indonesia, startup populer termasuk Tokopedia, Gojek, Bukalapak, Kopi Kenangan. (https://www.bayarind.id/blog/apa-itu-startup-pengertian-ciri-ciri-dan-tantangan-utamanya/#:~:text=Startup%20merupakan%20entitas%20bisnis%20yang,dampak%20signifikan%20di%20pasar%20global)\n11.\nIndustri Kreatif\nBidang ini memanfaatkan kreativitas dan keahlian manusia untuk menciptakan produk atau jasa dengan nilai tambah tinggi. Contohnya jasa desain grafis, penerbitan, musik, fashion lokal, atau kerajinan tangan. Industri kreatif bisa juga berbasis teknologi seperti aplikasi, animasi, game, dan konten digital. (https://eduindustri.ac.id/industri-kreatif/#:~:text=Secara%20sederhana%2C%20industri%20kreatif%20adalah,Kerajinan%20tangan%20(craft))\n12.\nBisnis Jaringan (Network Marketing / MLM)\nMultilevel marketing (MLM) adalah strategi pemasaran yang memungkinkan seorang salesperson merekrut salesperson lainnya, atau biasa disebut downline, untuk mendistribusikan produk suatu perusahaan. Sistem MLM ini memanfaatkan pelanggan sebagai jaringan distribusinya. Pelanggan yang lantas menjadi distributor dan merekrut pelanggan lainnya tersebut akan memperoleh persentase dari penjualan mereka maupun orang yang mereka rekrut. Para rekrutan ini adalah “downline” dari pelanggan sebelumnya yang telah menjadi distributor produk. (https://pluang.com/blog/glossary/multilevel-marketing-adalah)\n13.\nUsaha Berbasis Teknologi\nKewirausahaan berbasis teknologi merupakan jenis kewirausahaan yang menekankan penggunaan teknologi sebagai landasan utama dalam mengembangkan dan mengoperasikan bisnis. Ini mencakup pemanfaatan teknologi informasi dan komunikasi (TIK), seperti internet, komputasi awan, kecerdasan buatan, bahkan teknologi blockchain untuk menciptakan produk atau layanan baru, meningkatkan efisiensi operasional, dan mencapai pasar yang lebih luas. Dalam konteks ini, kewirausahaan berbasis teknologi juga dikenal dengan istilah technopreneurship. Teknologi tidak hanya menjadi alat, tetapi juga menjadi pendorong utama inovasi dan pertumbuhan. (https://bakrie.ac.id/articles/762-kewirausahaan-berbasis-teknologi-penuhi-dunia-digital-saat-ini-yuk-cari-tahu.html#:~:text=Apa%20itu%20Kewirausahaan%20Berbasis%20Teknologi,pendorong%20utama%20inovasi%20dan%20pertumbuhan)\nBerdasarkan Skala Usaha : \n1. Usaha Mikro:\nUsaha dengan skala terkecil, biasanya dimiliki dan dijalankan oleh perorangan atau badan usaha perorangan. Ciri-cirinya adalah memiliki aset maksimal Rp 50 juta (tidak termasuk tanah dan bangunan tempat usaha) dan omzet maksimal Rp 300 juta per tahun, menurut Kementerian Koperasi dan UKM. (https://sumbabaratkab.go.id/galleries/mengenal-usaha-mikro-kecil-dan-menengah-umkn/)\n2. Usaha Kecil\nUsaha yang lebih besar dari usaha mikro, tetapi masih berskala kecil. Kriteria usahanya adalah aset antara Rp 50 juta hingga Rp 500 juta (tidak termasuk tanah dan bangunan) dan omzet antara Rp 300 juta hingga Rp 2,5 miliar per tahun. (https://sumbabaratkab.go.id/galleries/mengenal-usaha-mikro-kecil-dan-menengah-umkn/ )\n3. Usaha Menengah \nUsaha yang lebih besar dari usaha kecil, dengan aset antara Rp 500 juta hingga Rp 10 miliar (tidak termasuk tanah dan bangunan) dan omzet antara Rp 2,5 miliar hingga Rp 50 miliar per tahun. (https://sumbabaratkab.go.id/galleries/mengenal-usaha-mikro-kecil-dan-menengah-umkn/)\n4. Usaha Besar\nUsaha dengan skala paling luas dan aset 10 miliar omzet di atas Rp 50 miliar per tahun, menurut UKMINDONESIA.ID. \nBerdasarkan Bentuk Badan Hukum :\n1. Perusahaan Perseorangan (PO)\nPerusahaan perseorangan adalah badan usaha yang dimiliki dan dikelola oleh satu individu. Pemilik memiliki kendali penuh atas semua aspek bisnis dan bertanggung jawab secara pribadi atas segala kewajiban perusahaan. Bentuk usaha ini cocok untuk usaha kecil dan sederhana yang tidak memerlukan banyak modal dan kegiatan yang kompleks. (Colegal Indonesia, Ethics)\n2. Persekutuan (Firma dan CV)\nPersekutuan adalah badan usaha yang dimiliki oleh dua orang atau lebih yang bekerja sama untuk mencapai tujuan bersama. Terdapat dua jenis persekutuan:\n•\nFirma: Setiap anggota firma memiliki tanggung jawab tidak terbatas atas kewajiban perusahaan. Keuntungan dan kerugian dibagi sesuai kesepakatan antar anggota. (mfauzimiftah98, EASYLEGAL)\n•\nCommanditaire Vennootschap (CV): Terdiri dari sekutu aktif yang mengelola perusahaan dan sekutu pasif yang hanya menyetor modal. Sekutu aktif bertanggung jawab penuh atas kewajiban perusahaan, sementara sekutu pasif hanya bertanggung jawab sebatas modal yang disetorkan. (Detik Finance)\n3. Perseroan Terbatas (PT)\nPerseroan Terbatas (PT) adalah badan usaha berbadan hukum yang modalnya terbagi dalam saham. Pemilik saham (pemegang saham) memiliki tanggung jawab terbatas sesuai dengan jumlah saham yang dimiliki. PT dapat didirikan oleh minimal dua orang dan memiliki struktur organisasi yang jelas, seperti direksi dan komisaris. (EASYLEGAL)\n4. Koperasi\nKoperasi adalah badan usaha yang dimiliki dan dikelola oleh anggotanya dengan tujuan untuk meningkatkan kesejahteraan bersama. Koperasi beroperasi berdasarkan prinsip-prinsip gerakan ekonomi rakyat yang berasaskan kekeluargaan. Keuntungan koperasi dibagikan kepada anggota sesuai dengan kontribusi mereka. (OnlinePajak)\n5. Badan Usaha Milik Negara (BUMN)\nBUMN adalah badan usaha yang seluruh atau sebagian besar modalnya dimiliki oleh negara. BUMN memiliki dua bentuk:(EASYLEGAL)\n•\nPersero: Badan usaha yang sebagian besar sahamnya dimiliki oleh negara dan berorientasi pada keuntungan. Contoh: PT Pertamina (Persero), PT Bank Rakyat Indonesia (Persero), PT KAI (Persero) (Detik Finance)\n•\nPerusahaan Umum (Perum): Badan usaha yang seluruh modalnya dimiliki oleh negara dan berorientasi pada pelayanan publik. Contoh: Perum Peruri, Perum Pegadaian. (Kontra Hukum)\n",
    "Tujuan Pembelajaran": "A.\nKegiatan Produksi (Praktek untuk menghasilkan Produk)\nB.\nKewirausahaan (Teori)\n",
    "THUMBNAIL\nYANG TIDAK MENGISI MALAMNYA DIPARANI ANOMALI SEBAGAI BERIKUT": ""
  },
  {
    "Timestamp": "8/1/2025 8:53:44",
    "Judul Materi": "Cascading Style Sheets (CSS)",
    "Mata Pelajaran": "Pemrograman Web",
    "Rombongan Belajar": "XI",
    "Gambar untuk kebutuhan materi ": "",
    "Jurusan": "PPLG/Rekayasa Perangkat Lunak (RPL)",
    "Isi Materi": "A. Definisi CSS\nCSS adalah singkatan dari Cascading Style Sheets. Secara sederhana, CSS adalah bahasa stylesheet yang digunakan untuk mendeskripsikan presentasi (tampilan) dari sebuah dokumen yang ditulis dalam bahasa markup, seperti HTML. Bayangkan HTML sebagai kerangka atau struktur dasar sebuah bangunan, sedangkan CSS adalah cat, furnitur, dan dekorasi yang membuat bangunan tersebut menarik dan nyaman untuk dilihat. Tanpa CSS, halaman web akan terlihat polos dan monoton, hanya berupa teks hitam di latar belakang putih tanpa tata letak yang menarik.\n1. Anatomi CSS\nAturan CSS (disebut juga rule set) terdiri dari dua bagian utama:\n•\nSelektor (Selector): Bagian ini menunjukkan elemen HTML mana yang akan diberi gaya. Selektor bisa berupa nama elemen HTML (misalnya p untuk paragraf, h1 untuk judul), ID (#namaID), kelas (.namaKelas), atau kombinasi dari ketiganya.\n•\nBlok Deklarasi (Declaration Block): Bagian ini berisi satu atau lebih deklarasi yang dipisahkan oleh titik koma (;). Blok deklarasi diletakkan di dalam kurung kurawal ({}).\nSetiap deklarasi terdiri dari dua bagian:\n•\nProperti (Property): Ini adalah atribut gaya yang ingin Anda ubah (misalnya color, font-size, background-color).\n•\nNilai (Value): Ini adalah nilai yang diberikan pada properti tersebut (misalnya blue, 16px, #f0f0f0).\nContoh Anatomi CSS:\nCSS\np {\n  color: blue; /* Deklarasi 1 */\n  font-size: 16px; /* Deklarasi 2 */\n}\nDalam contoh di atas:\n•\np adalah selektor.\n•\ncolor: blue; adalah deklarasi, di mana color adalah properti dan blue adalah nilai.\n•\nfont-size: 16px; adalah deklarasi, di mana font-size adalah properti dan 16px adalah nilai.\n2. Cara Kerja CSS\nCSS bekerja dengan menghubungkan aturan gaya ke elemen-elemen HTML. Ketika sebuah browser memuat halaman web, ia membaca dokumen HTML terlebih dahulu untuk memahami strukturnya. Kemudian, browser membaca file CSS (atau gaya CSS yang tertanam langsung di HTML) dan menerapkan aturan-aturan gaya tersebut ke elemen HTML yang sesuai dengan selektornya.\nAda tiga cara utama untuk menyertakan CSS dalam dokumen HTML:\n•\nCSS Eksternal (External CSS): Ini adalah metode yang paling umum dan direkomendasikan. Anda membuat file CSS terpisah (misalnya style.css) dan menautkannya ke dokumen HTML menggunakan tag <link> di bagian <head>:\nHTML\n<head>\n  <link rel=\"\"stylesheet\"\" href=\"\"style.css\"\">\n</head>\nKeuntungannya: Mudah dikelola, satu file CSS bisa digunakan untuk banyak halaman HTML, dan lebih efisien untuk caching.\n•\nCSS Internal (Internal CSS): Anda menulis aturan CSS langsung di dalam tag <style> di bagian <head> dokumen HTML:\nHTML\n<head>\n  <style>\n    h1 {\n      color: green;\n    }\n  </style>\n</head>\nCocok untuk gaya yang hanya berlaku pada satu halaman web tertentu.\n•\nCSS Inline (Inline CSS): Anda menerapkan gaya langsung pada elemen HTML menggunakan atribut style:\nHTML\n<p style=\"\"color: red; font-weight: bold;\"\">Ini adalah paragraf dengan gaya inline.</p>\nMeskipun mudah digunakan untuk gaya cepat, metode ini tidak direkomendasikan untuk penggunaan luas karena membuat kode HTML sulit dibaca dan tidak memisahkan struktur dari presentasi.\nPrinsip \"\"Cascading\"\" dalam CSS berarti bahwa jika ada konflik aturan gaya (misalnya, elemen yang sama diberi gaya berbeda dari sumber yang berbeda), browser akan menentukan gaya mana yang akan diterapkan berdasarkan hierarki dan spesifisitas.\n \n________________________________________\nB. Menyajikan CSS untuk Memformat Tampilan Teks\nCSS menyediakan berbagai properti untuk mengontrol tampilan teks di halaman web.\n1. Pengaturan Warna pada Teks\nProperti color digunakan untuk mengatur warna teks. Nilai warna dapat berupa nama warna (misalnya red, blue), kode heksadesimal (misalnya #FF0000), atau fungsi RGB/RGBA (misalnya rgb(255, 0, 0)).\nContoh:\nCSS\np {\n  color: #336699; /* Warna biru keabu-abuan */\n}\nh2 {\n  color: green; /* Warna hijau */\n}\n2. Pengaturan Spasi Antar Karakter\nProperti letter-spacing digunakan untuk mengatur jarak horizontal antar karakter dalam sebuah teks. Nilai dapat berupa satuan panjang (misalnya px, em, pt).\nContoh:\nCSS\nspan {\n  letter-spacing: 2px; /* Jarak antar karakter 2 piksel */\n}\n3. Pengaturan Bentuk-Bentuk Teks\nCSS memungkinkan Anda mengatur berbagai aspek bentuk teks, termasuk jenis huruf, ukuran, dan gaya.\n•\nfont-family (Jenis Huruf): Menentukan jenis huruf yang akan digunakan. Penting untuk menyediakan beberapa font sebagai fallback jika font pertama tidak tersedia di sistem pengguna.\n•\nfont-size (Ukuran Huruf): Mengatur ukuran teks. Nilai dapat berupa px, em, rem, %, atau kata kunci (misalnya medium, large).\n•\nfont-weight (Ketebalan Huruf): Mengatur ketebalan teks (misalnya normal, bold, bolder, lighter, atau nilai numerik dari 100 hingga 900).\n•\nfont-style (Gaya Huruf): Mengatur gaya teks (misalnya normal, italic, oblique).\n•\ntext-decoration (Dekorasi Teks): Menambahkan atau menghapus garis dekorasi pada teks (misalnya none, underline, overline, line-through).\nContoh:\nCSS\nbody {\n  font-family: Arial, sans-serif; /* Menggunakan Arial, jika tidak ada gunakan font sans-serif default */\n  font-size: 18px; /* Ukuran font 18 piksel */\n}\na {\n  font-weight: bold; /* Teks tebal */\n  font-style: italic; /* Teks miring */\n  text-decoration: none; /* Menghilangkan garis bawah pada tautan */\n}\n4. Pengaturan Spasi Antar Kata\nProperti word-spacing digunakan untuk mengatur jarak horizontal antar kata dalam sebuah teks. Nilai dapat berupa satuan panjang (misalnya px, em).\nContoh:\nCSS\nh3 {\n  word-spacing: 5px; /* Jarak antar kata 5 piksel */\n}\n5. Pengaturan Jarak Indentasi Paragraf\nProperti text-indent digunakan untuk membuat indentasi (jarak masuk) pada baris pertama sebuah blok teks.\nContoh:\nCSS\np {\n  text-indent: 30px; /* Indentasi 30 piksel pada baris pertama paragraf */\n}\n6. Pengubahan Huruf Besar dan Huruf Kecil dari Sebuah Teks\nProperti text-transform digunakan untuk mengonversi teks menjadi huruf besar, huruf kecil, atau mengkapitalisasi setiap kata.\n•\nuppercase: Mengubah semua teks menjadi huruf besar.\n•\nlowercase: Mengubah semua teks menjadi huruf kecil.\n•\ncapitalize: Mengkapitalisasi huruf pertama setiap kata.\n•\nnone: Tidak ada transformasi (default).\nContoh:\nCSS\nh1 {\n  text-transform: uppercase; /* Semua huruf besar */\n}\n.caption {\n  text-transform: capitalize; /* Huruf pertama setiap kata kapital */\n}\n7. Pemberian Efek Bayangan pada Teks\nProperti text-shadow digunakan untuk menambahkan efek bayangan pada teks. Nilai properti ini terdiri dari offset horizontal, offset vertikal, radius blur, dan warna bayangan.\nSintaks: text-shadow: offset-x offset-y blur-radius color;\nContoh:\nCSS\nh2 {\n  text-shadow: 2px 2px 5px #888888; /* Bayangan 2px ke kanan, 2px ke bawah, blur 5px, warna abu-abu */\n}\n8. Pengaturan Perataan Teks\nProperti text-align digunakan untuk mengatur perataan horizontal teks di dalam elemen blok.\n•\nleft: Rata kiri (default).\n•\nright: Rata kanan.\n•\ncenter: Rata tengah.\n•\njustify: Meratakan teks agar memenuhi lebar elemen, dengan mengatur spasi antar kata.\nContoh:\nCSS\n.artikel {\n  text-align: justify; /* Teks rata kanan-kiri */\n}\n.judul {\n  text-align: center; /* Judul rata tengah */\n}\n \n________________________________________\nC. Menyajikan CSS untuk Memformat Tampilan Multimedia\nCSS juga sangat berguna untuk mengontrol tampilan gambar dan video di halaman web.\n1. CSS pada Tampilan Gambar\nCSS dapat digunakan untuk mengatur ukuran, border, padding, margin, dan efek lainnya pada gambar.\n•\nwidth dan height: Mengatur lebar dan tinggi gambar. Anda bisa menggunakan nilai piksel, persentase, atau auto.\n•\nborder: Menambahkan border di sekitar gambar.\n•\nborder-radius: Membuat sudut gambar menjadi melengkung.\n•\nbox-shadow: Menambahkan efek bayangan di sekitar gambar.\n•\nfloat: Mengatur gambar agar mengambang (rata kiri atau kanan) di samping teks.\nContoh:\nCSS\nimg {\n  width: 200px; /* Lebar gambar 200 piksel */\n  height: auto; /* Tinggi otomatis menyesuaikan proporsi */\n  border: 2px solid #ccc; /* Border abu-abu 2 piksel */\n  border-radius: 10px; /* Sudut melengkung 10 piksel */\n  margin: 10px; /* Jarak luar 10 piksel dari elemen lain */\n}\n.gambar-kanan {\n  float: right; /* Gambar mengambang di kanan teks */\n  margin-left: 15px;\n}\n2. CSS untuk Menampilkan Gambar Latar Belakang (Background)\nProperti background-image digunakan untuk menambahkan gambar sebagai latar belakang elemen.\n•\nbackground-image: URL gambar.\n•\nbackground-repeat: Mengontrol apakah gambar diulang (misalnya no-repeat, repeat-x, repeat-y).\n•\nbackground-position: Menentukan posisi gambar latar belakang (misalnya center top, 50% 50%).\n•\nbackground-size: Mengatur ukuran gambar latar belakang (misalnya cover, contain, 100% auto).\n•\nbackground-attachment: Menentukan apakah gambar latar belakang scroll bersama konten atau tetap (misalnya scroll, fixed).\n \nContoh:\nCSS\nbody {\n  background-image: url('gambar/latar.jpg'); /* Gambar latar belakang */\n  background-repeat: no-repeat; /* Tidak diulang */\n  background-position: center center; /* Posisi di tengah */\n  background-size: cover; /* Menutupi seluruh area */\n}\n.hero-section {\n  background-image: url('gambar/banner.png');\n  background-size: contain; /* Gambar akan muat sepenuhnya dalam elemen */\n  background-repeat: no-repeat;\n  background-position: top center;\n  padding: 50px;\n}\n3. CSS untuk Menyisipkan Gambar\nIni sebenarnya lebih kepada penggunaan tag HTML <img> untuk menyisipkan gambar. Namun, CSS lah yang akan mengatur tampilannya setelah disisipkan. Jadi, konsepnya sama dengan poin C.1.\n4. CSS pada Tampilan Video\nSama seperti gambar, CSS tidak menyisipkan video, melainkan mengatur tampilannya setelah video disisipkan menggunakan tag HTML <video>.\n•\nwidth dan height: Mengatur dimensi video.\n•\nmax-width: Memastikan video tidak melebihi lebar elemen induk, sangat penting untuk responsive design.\n•\nborder, box-shadow: Menambahkan efek visual pada player video.\nContoh:\nCSS\nvideo {\n  max-width: 100%; /* Video akan menyesuaikan lebar elemen induk */\n  height: auto; /* Tinggi otomatis */\n  display: block; /* Menghilangkan spasi ekstra di bawah video */\n  border: 1px solid #ddd;\n}\n5. CSS untuk Embed Video dari YouTube\nVideo YouTube biasanya disisipkan menggunakan elemen <iframe>. CSS dapat digunakan untuk mengatur ukuran dan posisi iframe tersebut agar tampil responsif. Teknik yang umum digunakan adalah menggunakan padding berbasis persentase untuk mempertahankan rasio aspek video.\nContoh (Responsif Embed YouTube):\nHTML:\nHTML\n<div class=\"\"video-container\"\">\n  <iframe src=\"\"https://www.youtube.com/embed/VIDEO_ID_ANDA\"\" frameborder=\"\"0\"\" allowfullscreen></iframe>\n</div>\nCSS:\nCSS\n.video-container {\n  position: relative;\n  padding-bottom: 56.25%; /* Rasio aspek 16:9 (9 / 16 = 0.5625) */\n  height: 0;\n  overflow: hidden;\n  max-width: 100%;\n  background: #000;\n}\n.video-container iframe {\n  position: absolute;\n  top: 0;\n  left: 0;\n  width: 100%;\n  height: 100%;\n}\nPenjelasan: padding-bottom: 56.25%; menciptakan ruang vertikal yang akan menjaga rasio aspek 16:9 saat lebar elemen berubah. position: absolute; pada iframe memungkinkannya untuk mengisi ruang yang dibuat oleh padding.\n \n________________________________________\nD. Penerapan CSS pada Elemen Tabel\nCSS sangat efektif untuk memperindah tampilan tabel HTML yang cenderung polos secara default.\n1. Konsep Dasar Model Box\nSebelum membahas lebih jauh, penting untuk memahami Model Box CSS. Setiap elemen HTML, termasuk tabel, secara konseptual dibungkus dalam sebuah \"\"kotak\"\" persegi panjang. Model Box ini terdiri dari beberapa lapisan:\n•\nKonten (Content): Area di mana konten sebenarnya (teks, gambar, dll.) berada.\n•\nPadding: Ruang kosong di antara border dan konten.\n•\nBorder: Garis batas di sekitar padding dan konten.\n•\nMargin: Ruang kosong di luar border, memisahkan elemen dari elemen lain di sekitarnya.\nMemahami model box sangat krusial untuk mengatur tata letak dan jarak antar elemen, termasuk sel-sel tabel.\n2. Pengaturan Border Tabel\nAnda dapat mengatur border untuk tabel secara keseluruhan, baris, maupun sel individual (<td> dan <th>).\nContoh:\nCSS\ntable {\n  border-collapse: collapse; /* Menggabungkan border sel yang berdekatan */\n  width: 100%;\n}\ntable, th, td {\n  border: 1px solid #999; /* Border 1 piksel solid abu-abu */\n}\nth {\n  border-bottom: 2px solid #555; /* Border bawah lebih tebal untuk header */\n}\nCatatan Penting: Properti border-collapse: collapse; pada tabel sangat penting untuk membuat border antar sel terlihat tunggal dan rapi, bukan ganda.\n \n3. Pengaturan Lebar dan Tinggi Tabel\nProperti width dan height dapat diterapkan pada tabel, serta pada sel (<th> dan <td>).\nContoh:\nCSS\ntable {\n  width: 80%; /* Lebar tabel 80% dari elemen induk */\n  height: auto;\n}\nth, td {\n  min-width: 100px; /* Lebar minimum sel */\n  height: 40px; /* Tinggi sel 40 piksel */\n}\n4. Pengaturan text-align pada Tabel\nProperti text-align dapat digunakan untuk meratakan teks di dalam sel tabel.\nContoh:\nCSS\nth {\n  text-align: center; /* Teks header rata tengah */\n}\ntd {\n  text-align: left; /* Teks data rata kiri */\n}\ntd.angka {\n  text-align: right; /* Sel dengan kelas 'angka' rata kanan */\n}\n5. Pengaturan Padding Tabel\nProperti padding digunakan untuk memberikan ruang kosong di dalam sel, antara konten dan border sel.\nContoh:\nCSS\nth, td {\n  padding: 8px 12px; /* Padding atas/bawah 8px, kiri/kanan 12px */\n}\n6. Pengaturan Warna pada Tabel\nAnda bisa mengatur warna latar belakang (background-color) dan warna teks (color) untuk seluruh tabel, baris, atau sel individual.\nContoh:\nCSS\ntable {\n  background-color: #f5f5f5; /* Warna latar belakang tabel abu-abu muda */\n}\nth {\n  background-color: #4CAF50; /* Warna latar belakang header hijau */\n  color: white; /* Warna teks header putih */\n}\ntr:nth-child(even) { /* Efek zebra striping: baris genap */\n  background-color: #e0e0e0;\n}\ntd.highlight {\n  background-color: #ffffcc; /* Warna latar belakang sel dengan kelas 'highlight' kuning muda */\n}\n \n________________________________________\nE. Penerapan CSS pada Formulir\nFormulir HTML, secara default, seringkali terlihat kurang menarik. CSS sangat penting untuk mengubah tampilan input, textarea, button, dan elemen formulir lainnya agar lebih menarik dan mudah digunakan.\n1. CSS pada Elemen form\nAnda dapat memberi gaya pada elemen form itu sendiri untuk mengatur tata letak dan penampilan umumnya.\nContoh:\nCSS\nform {\n  background-color: #fff;\n  padding: 20px;\n  border-radius: 8px;\n  box-shadow: 0 2px 5px rgba(0, 0, 0, 0.1);\n  max-width: 500px; /* Lebar maksimal form */\n  margin: 20px auto; /* Rata tengah dan jarak margin */\n  display: flex; /* Untuk layout yang fleksibel */\n  flex-direction: column; /* Elemen diatur vertikal */\n  gap: 15px; /* Jarak antar elemen anak */\n}\nlabel {\n  font-weight: bold;\n  margin-bottom: 5px;\n  display: block; /* Agar label berada di atas input */\n}\n2. CSS pada Input Teks\nMeliputi <input type=\"\"text\"\">, <input type=\"\"email\"\">, <input type=\"\"password\"\">, dll.\nContoh:\nCSS\ninput[type=\"\"text\"\"],\ninput[type=\"\"email\"\"],\ninput[type=\"\"password\"\"] {\n  width: calc(100% - 20px); /* Lebar 100% dikurangi padding */\n  padding: 10px;\n  margin-bottom: 10px;\n  border: 1px solid #ccc;\n  border-radius: 4px;\n  box-sizing: border-box; /* Agar padding tidak menambah lebar */\n}\ninput[type=\"\"text\"\"]:focus,\ninput[type=\"\"email\"\"]:focus,\ninput[type=\"\"password\"\"]:focus {\n  border-color: #007bff; /* Warna border saat fokus */\n  outline: none; /* Menghilangkan outline default browser */\n  box-shadow: 0 0 5px rgba(0, 123, 255, 0.25);\n}\n3. CSS pada text field (yaitu textarea)\nElemen textarea memungkinkan input teks multi-baris.\nContoh:\nCSS\ntextarea {\n  width: calc(100% - 20px);\n  padding: 10px;\n  margin-bottom: 10px;\n  border: 1px solid #ccc;\n  border-radius: 4px;\n  box-sizing: border-box;\n  resize: vertical; /* Hanya bisa diubah ukurannya secara vertikal */\n  min-height: 100px;\n}\ntextarea:focus {\n  border-color: #007bff;\n  outline: none;\n  box-shadow: 0 0 5px rgba(0, 123, 255, 0.25);\n}\n4. CSS pada button\nTombol pada formulir (<button> atau <input type=\"\"submit\"\">, <input type=\"\"button\"\">).\nContoh:\nCSS\nbutton,\ninput[type=\"\"submit\"\"],\ninput[type=\"\"button\"\"] {\n  background-color: #007bff;\n  color: white;\n  padding: 10px 20px;\n  border: none;\n  border-radius: 5px;\n  cursor: pointer;\n  font-size: 16px;\n  transition: background-color 0.3s ease; /* Efek transisi saat hover */\n}\nbutton:hover,\ninput[type=\"\"submit\"\"]:hover,\ninput[type=\"\"button\"\"]:hover {\n  background-color: #0056b3;\n}\nbutton:active,\ninput[type=\"\"submit\"\"]:active,\ninput[type=\"\"button\"\"]:active {\n  background-color: #004085;\n}\n5. CSS pada radio button\nRadio button (<input type=\"\"radio\"\">) dan checkbox (<input type=\"\"checkbox\"\">) secara default sulit diberi gaya secara konsisten di semua browser. Pendekatan umum adalah menyembunyikan input asli dan menggantinya dengan elemen yang diberi gaya CSS.\nContoh (untuk radio button, bisa diadaptasi untuk checkbox):\nHTML:\nHTML\n<label class=\"\"radio-container\"\">Opsi 1\n  <input type=\"\"radio\"\" checked=\"\"checked\"\" name=\"\"radio\"\">\n  <span class=\"\"checkmark\"\"></span>\n</label>\n<label class=\"\"radio-container\"\">Opsi 2\n  <input type=\"\"radio\"\" name=\"\"radio\"\">\n  <span class=\"\"checkmark\"\"></span>\n</label>\nCSS:\nCSS\n/* Sembunyikan radio button asli */\n.radio-container input {\n  position: absolute;\n  opacity: 0;\n  cursor: pointer;\n}\n/* Buat penanda radio button kustom */\n.checkmark {\n  position: absolute;\n  top: 0;\n  left: 0;\n  height: 20px;\n  width: 20px;\n  background-color: #eee;\n  border-radius: 50%; /* Bentuk bulat untuk radio */\n}\n/* Hover, checked, dan efek lainnya */\n.radio-container:hover input ~ .checkmark {\n  background-color: #ccc;\n}\n.radio-container input:checked ~ .checkmark {\n  background-color: #2196F3;\n}\n/* Buat indikator (titik) saat checked */\n.checkmark:after {\n  content: \"\"\"\";\n  position: absolute;\n  display: none;\n}\n.radio-container input:checked ~ .checkmark:after {\n  display: block;\n}\n.radio-container .checkmark:after {\n  top: 6px;\n  left: 6px;\n  width: 8px;\n  height: 8px;\n  border-radius: 50%;\n  background: white;\n}\nCatatan: Styling radio button dan checkbox lebih kompleks karena perlu menyembunyikan elemen asli dan membuat visual kustom.\n6. CSS pada text box (yaitu select untuk dropdown)\nIstilah \"\"text box\"\" seringkali mengacu pada input teks tunggal atau multi-baris. Jika yang dimaksud adalah elemen dropdown (<select>), maka gaya CSS juga dapat diterapkan.\nContoh (untuk elemen select):\nCSS\nselect {\n  width: 100%;\n  padding: 10px;\n  margin-bottom: 10px;\n  border: 1px solid #ccc;\n  border-radius: 4px;\n  box-sizing: border-box;\n  background-color: #f9f9f9;\n  appearance: none; /* Menghilangkan gaya default browser (terutama panah dropdown) */\n  -webkit-appearance: none;\n  -moz-appearance: none;\n  background-image: url('data:image/svg+xml;utf8,<svg fill=\"\"%23444444\"\" height=\"\"24\"\" viewBox=\"\"0 0 24 24\"\" width=\"\"24\"\" xmlns=\"\"http://www.w3.org/2000/svg\"\"><path d=\"\"M7 10l5 5 5-5z\"\"/><path d=\"\"M0 0h24v24H0z\"\" fill=\"\"none\"\"/></svg>'); /* Menambahkan panah kustom */\n  background-repeat: no-repeat;\n  background-position: right 10px center;\n  background-size: 20px;\n}\nselect:focus {\n  border-color: #007bff;\n  outline: none;\n  box-shadow: 0 0 5px rgba(0, 123, 255, 0.25);\n}\n________________________________________\n \n",
    "Tujuan Pembelajaran": "",
    "THUMBNAIL\nYANG TIDAK MENGISI MALAMNYA DIPARANI ANOMALI SEBAGAI BERIKUT": ""
  }
]